In [12]:
!pip install pandas

In [285]:
# !pip install faker

In [5]:
import pandas as pd
import numpy as np
import random
# import faker

In [287]:
dict_ = {
    'name': ['Ali', 'Khan', 'Omer', 'Dark'],
    'marks': [93, 21, 35, 90],
    'city': ['Karachi', 'Lahore', 'Islamabad', 'Peshawar']
}

In [288]:
dict_

{'name': ['Ali', 'Khan', 'Omer', 'Dark'],
 'marks': [93, 21, 35, 90],
 'city': ['Karachi', 'Lahore', 'Islamabad', 'Peshawar']}

In [289]:
df = pd.DataFrame(dict_)

In [290]:
df

   name  marks       city
0   Ali     93    Karachi
1  Khan     21     Lahore
2  Omer     35  Islamabad
3  Dark     90   Peshawar

In [291]:
df.name

0     Ali
1    Khan
2    Omer
3    Dark
Name: name, dtype: object

In [292]:

df.to_csv('students.csv') # if you not print the index of dataFrame then use the index=False

In [293]:
df.head(2)

   name  marks     city
0   Ali     93  Karachi
1  Khan     21   Lahore

In [294]:
df.tail(2)

   name  marks       city
2  Omer     35  Islamabad
3  Dark     90   Peshawar

In [295]:
df.describe()

          marks
count   4.00000
mean   59.75000
std    37.12479
min    21.00000
25%    31.50000
50%    62.50000
75%    90.75000
max    93.00000

In [296]:
df.index = ['First', 'Second', 'Third', 'Fourth']

In [297]:
df

        name  marks       city
First    Ali     93    Karachi
Second  Khan     21     Lahore
Third   Omer     35  Islamabad
Fourth  Dark     90   Peshawar

In [298]:
# Initialize Faker for generating fake data
# fake = faker.Faker()

In [299]:
# # List of majors and cities for more realistic data
# majors = ['Computer Science', 'Biology', 'Engineering', 'Business', 'Mathematics', 'Physics', 'Chemistry',
#            'History', 'English', 'Economics', 'Psychology', 'Sociology', 'Political Science', 'Art', 'Music']
# cities = ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Philadelphia', 'Phoenix', 'San Antonio',
#            'San Diego', 'Dallas', 'San Jose', 'Austin', 'Jacksonville', 'Fort Worth', 'Columbus', 'Charlotte']

In [300]:
# # Generate data
# data = []
# for i in range(1, 101):
#     student = {
#         "id": i,
#         "name": fake.name(),
#         "major": random.choice(majors),
#         "GPA": round(random.uniform(2.0, 4.0), 2),
#         "city": random.choice(cities),
#         "age": random.randint(18, 25),
#         "email": fake.email(),
#         "graduation_year": random.randint(2023, 2027)
#     }
#     data.append(student)

# # Create DataFrame
# df = pd.DataFrame(data)

In [301]:
# # Save to CSV
# file_path = 'students3.csv'
# df.to_csv(file_path, index=False)

# file_path

In [302]:

dff = pd.read_csv('Dark.csv')

In [303]:
dff

,id,name,major,GPA,city,age,email,graduation_year
0,1,Dark,Business,2.56,Jacksonville,19,dark@gmail.com,2024
1,2,Jonathan Johnston,Business,3.21,San Diego,20,rmurphy@gmail.com,2025
2,3,Natalie Bentley,Engineering,3.65,San Jose,25,robinsonrita@diaz-miranda.com,2026
3,4,Anita Mills,Chemistry,2.36,Philadelphia,24,qhardy@hotmail.com,2025
4,5,Danielle Cummings,Psychology,2.23,San Diego,19,deleonadam@young-stephenson.com,2024
...,...,...,...,...,...,...,...,...
95,96,Christina Quinn,Biology,2.55,Columbus,24,lewiskelly@dawson.com,2023
96,97,Chad Fernandez,Art,2.95,Phoenix,20,kimberlyjohnson@leonard-munoz.com,2026
97,98,Scott Smith,Art,2.91,New York,21,savagekayla@johnson.com,2025
98,99,Stephanie Carrillo,Biology,3.28,San Diego,19,smithmichelle@ramos.com,2023
99,100,Jeffrey Farrell,Engineering,3.43,Houston,24,megan43@yahoo.com,2026

In [304]:
Dark = pd.DataFrame(dff)

In [305]:
Dark

,id,name,major,GPA,city,age,email,graduation_year
0,1,Dark,Business,2.56,Jacksonville,19,dark@gmail.com,2024
1,2,Jonathan Johnston,Business,3.21,San Diego,20,rmurphy@gmail.com,2025
2,3,Natalie Bentley,Engineering,3.65,San Jose,25,robinsonrita@diaz-miranda.com,2026
3,4,Anita Mills,Chemistry,2.36,Philadelphia,24,qhardy@hotmail.com,2025
4,5,Danielle Cummings,Psychology,2.23,San Diego,19,deleonadam@young-stephenson.com,2024
...,...,...,...,...,...,...,...,...
95,96,Christina Quinn,Biology,2.55,Columbus,24,lewiskelly@dawson.com,2023
96,97,Chad Fernandez,Art,2.95,Phoenix,20,kimberlyjohnson@leonard-munoz.com,2026
97,98,Scott Smith,Art,2.91,New York,21,savagekayla@johnson.com,2025
98,99,Stephanie Carrillo,Biology,3.28,San Diego,19,smithmichelle@ramos.com,2023
99,100,Jeffrey Farrell,Engineering,3.43,Houston,24,megan43@yahoo.com,2026

In [306]:
Dark['age'][0] = 19

C:\Users\Dark_Coder\AppData\Local\Temp\ipykernel_6396\2673981177.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  Dark['age'][0] = 19
C:\Users\Dark_Coder\AppData\Local\Temp\ipykernel_6396\2673981177.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  Dark['age'][0] = 19

In [307]:
Dark

,id,name,major,GPA,city,age,email,graduation_year
0,1,Dark,Business,2.56,Jacksonville,19,dark@gmail.com,2024
1,2,Jonathan Johnston,Business,3.21,San Diego,20,rmurphy@gmail.com,2025
2,3,Natalie Bentley,Engineering,3.65,San Jose,25,robinsonrita@diaz-miranda.com,2026
3,4,Anita Mills,Chemistry,2.36,Philadelphia,24,qhardy@hotmail.com,2025
4,5,Danielle Cummings,Psychology,2.23,San Diego,19,deleonadam@young-stephenson.com,2024
...,...,...,...,...,...,...,...,...
95,96,Christina Quinn,Biology,2.55,Columbus,24,lewiskelly@dawson.com,2023
96,97,Chad Fernandez,Art,2.95,Phoenix,20,kimberlyjohnson@leonard-munoz.com,2026
97,98,Scott Smith,Art,2.91,New York,21,savagekayla@johnson.com,2025
98,99,Stephanie Carrillo,Biology,3.28,San Diego,19,smithmichelle@ramos.com,2023
99,100,Jeffrey Farrell,Engineering,3.43,Houston,24,megan43@yahoo.com,2026

In [308]:
Dark['email'][0] = 'dark@gmail.com'
Dark['name'][0] = 'Dark'

C:\Users\Dark_Coder\AppData\Local\Temp\ipykernel_6396\2668981450.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  Dark['email'][0] = 'dark@gmail.com'
C:\Users\Dark_Coder\AppData\Local\Temp\ipykernel_6396\2668981450.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  Dark['email'][0] = 'dark@gmail.com'
C:\Users\Dark_Coder\AppData\Local\Temp\ipykernel_6396\2668981450.py:2: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  Dark['name'][0] = 'Dark'
C:\Users\Dark_Coder\AppData\Local\Temp\ipykernel_6396\2668981450.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  Dark['name'][0] = 'Dark'

In [309]:
Dark

,id,name,major,GPA,city,age,email,graduation_year
0,1,Dark,Business,2.56,Jacksonville,19,dark@gmail.com,2024
1,2,Jonathan Johnston,Business,3.21,San Diego,20,rmurphy@gmail.com,2025
2,3,Natalie Bentley,Engineering,3.65,San Jose,25,robinsonrita@diaz-miranda.com,2026
3,4,Anita Mills,Chemistry,2.36,Philadelphia,24,qhardy@hotmail.com,2025
4,5,Danielle Cummings,Psychology,2.23,San Diego,19,deleonadam@young-stephenson.com,2024
...,...,...,...,...,...,...,...,...
95,96,Christina Quinn,Biology,2.55,Columbus,24,lewiskelly@dawson.com,2023
96,97,Chad Fernandez,Art,2.95,Phoenix,20,kimberlyjohnson@leonard-munoz.com,2026
97,98,Scott Smith,Art,2.91,New York,21,savagekayla@johnson.com,2025
98,99,Stephanie Carrillo,Biology,3.28,San Diego,19,smithmichelle@ramos.com,2023
99,100,Jeffrey Farrell,Engineering,3.43,Houston,24,megan43@yahoo.com,2026

In [310]:
Dark.to_csv('Dark.csv', index=False)

In [311]:
ser_df = pd.Series(np.random.randint(1, 100, size=10))

In [312]:
ser_df

0    88
1    28
2     9
3    13
4    74
5    89
6    65
7    94
8    81
9    67
dtype: int32

In [313]:
type(ser_df)

pandas.core.series.Series

In [314]:
ran_df = pd.DataFrame(np.random.randint(1, 100, size=(5, 10)))

In [315]:
type(ran_df)

pandas.core.frame.DataFrame

In [316]:
ran_df

    0   1   2   3   4   5   6   7   8   9
0  29  44   4  20  83  84  23   3  34  45
1  25  59   6  80  85  41  74  15  81  71
2   5  29  23  51  74  47  74   1  64  26
3  28  22  95  26  44  79  62  17  35  31
4  30  15  86  27  82  40  94  11  87  20

In [317]:
ran_df.describe()

,0,1,2,3,4,5,6,7,8,9
count,5.000000,5.000000,5.000000,5.000000,5.000000,5.000000,5.000000,5.000000,5.000000,5.000000
mean,23.400000,33.800000,42.800000,40.800000,73.600000,58.200000,65.400000,9.400000,60.200000,38.600000
std,10.454664,17.711578,44.279792,24.913852,17.067513,21.510463,26.340084,7.127412,24.933913,20.329781
min,5.000000,15.000000,4.000000,20.000000,44.000000,40.000000,23.000000,1.000000,34.000000,20.000000
25%,25.000000,22.000000,6.000000,26.000000,74.000000,41.000000,62.000000,3.000000,35.000000,26.000000
50%,28.000000,29.000000,23.000000,27.000000,82.000000,47.000000,74.000000,11.000000,64.000000,31.000000
75%,29.000000,44.000000,86.000000,51.000000,83.000000,79.000000,74.000000,15.000000,81.000000,45.000000
max,30.000000,59.000000,95.000000,80.000000,85.000000,84.000000,94.000000,17.000000,87.000000,71.000000

In [318]:
ran_df.dtypes

0    int32
1    int32
2    int32
3    int32
4    int32
5    int32
6    int32
7    int32
8    int32
9    int32
dtype: object

In [319]:
ran_df[0][0] = 'dark'

C:\Users\Dark_Coder\AppData\Local\Temp\ipykernel_6396\2046308830.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  ran_df[0][0] = 'dark'
C:\Users\Dark_Coder\AppData\Local\Temp\ipykernel_6396\2046308830.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'dark' has dtype incompatible with int32, please explicitly cast to a compatible dtype first.
  ran_df[0][0] = 'dark'

In [320]:
ran_df

      0   1   2   3   4   5   6   7   8   9
0  dark  44   4  20  83  84  23   3  34  45
1    25  59   6  80  85  41  74  15  81  71
2     5  29  23  51  74  47  74   1  64  26
3    28  22  95  26  44  79  62  17  35  31
4    30  15  86  27  82  40  94  11  87  20

In [321]:
type(ran_df)

pandas.core.frame.DataFrame

In [322]:
ran_df.dtypes

0    object
1     int32
2     int32
3     int32
4     int32
5     int32
6     int32
7     int32
8     int32
9     int32
dtype: object

In [323]:
ran_df.index

RangeIndex(start=0, stop=5, step=1)

In [324]:
pd.Index(ran_df)

Index([('dark', 44, 4, 20, 83, 84, 23, 3, 34, 45),
          (25, 59, 6, 80, 85, 41, 74, 15, 81, 71),
           (5, 29, 23, 51, 74, 47, 74, 1, 64, 26),
         (28, 22, 95, 26, 44, 79, 62, 17, 35, 31),
         (30, 15, 86, 27, 82, 40, 94, 11, 87, 20)],
      dtype='object')

In [325]:
ran_df.columns

RangeIndex(start=0, stop=10, step=1)

In [326]:
ran_df.to_numpy()

array([['dark', 44, 4, 20, 83, 84, 23, 3, 34, 45],
       [25, 59, 6, 80, 85, 41, 74, 15, 81, 71],
       [5, 29, 23, 51, 74, 47, 74, 1, 64, 26],
       [28, 22, 95, 26, 44, 79, 62, 17, 35, 31],
       [30, 15, 86, 27, 82, 40, 94, 11, 87, 20]], dtype=object)

In [327]:
ran_df.T

      0   1   2   3   4
0  dark  25   5  28  30
1    44  59  29  22  15
2     4   6  23  95  86
3    20  80  51  26  27
4    83  85  74  44  82
5    84  41  47  79  40
6    23  74  74  62  94
7     3  15   1  17  11
8    34  81  64  35  87
9    45  71  26  31  20

In [328]:
ran_df[0][0] = 50

In [329]:
ran_df

    0   1   2   3   4   5   6   7   8   9
0  50  44   4  20  83  84  23   3  34  45
1  25  59   6  80  85  41  74  15  81  71
2   5  29  23  51  74  47  74   1  64  26
3  28  22  95  26  44  79  62  17  35  31
4  30  15  86  27  82  40  94  11  87  20

In [330]:
ran_df.sort_index(axis=0, ascending=False)

    0   1   2   3   4   5   6   7   8   9
4  30  15  86  27  82  40  94  11  87  20
3  28  22  95  26  44  79  62  17  35  31
2   5  29  23  51  74  47  74   1  64  26
1  25  59   6  80  85  41  74  15  81  71
0  50  44   4  20  83  84  23   3  34  45

In [331]:
ran_df.sort_index(axis=1, ascending=False)

    9   8   7   6   5   4   3   2   1   0
0  45  34   3  23  84  83  20   4  44  50
1  71  81  15  74  41  85  80   6  59  25
2  26  64   1  74  47  74  51  23  29   5
3  31  35  17  62  79  44  26  95  22  28
4  20  87  11  94  40  82  27  86  15  30

In [332]:
ran_df[0]

0    50
1    25
2     5
3    28
4    30
Name: 0, dtype: object

In [333]:
type(ran_df[0])

pandas.core.series.Series

In [334]:
new_ran_df = ran_df

In [335]:
new_ran_df[0][0] = 100

In [336]:
new_ran_df

     0   1   2   3   4   5   6   7   8   9
0  100  44   4  20  83  84  23   3  34  45
1   25  59   6  80  85  41  74  15  81  71
2    5  29  23  51  74  47  74   1  64  26
3   28  22  95  26  44  79  62  17  35  31
4   30  15  86  27  82  40  94  11  87  20

In [337]:
ran_df

     0   1   2   3   4   5   6   7   8   9
0  100  44   4  20  83  84  23   3  34  45
1   25  59   6  80  85  41  74  15  81  71
2    5  29  23  51  74  47  74   1  64  26
3   28  22  95  26  44  79  62  17  35  31
4   30  15  86  27  82  40  94  11  87  20

In [338]:
copy_ran_df = ran_df.copy()

In [339]:
copy_ran_df[0][0] = 500

C:\Users\Dark_Coder\AppData\Local\Temp\ipykernel_6396\56683498.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  copy_ran_df[0][0] = 500
C:\Users\Dark_Coder\AppData\Local\Temp\ipykernel_6396\56683498.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  copy_ran_df[0][0] = 500

In [340]:
copy_ran_df

     0   1   2   3   4   5   6   7   8   9
0  500  44   4  20  83  84  23   3  34  45
1   25  59   6  80  85  41  74  15  81  71
2    5  29  23  51  74  47  74   1  64  26
3   28  22  95  26  44  79  62  17  35  31
4   30  15  86  27  82  40  94  11  87  20

In [341]:
ran_df

     0   1   2   3   4   5   6   7   8   9
0  100  44   4  20  83  84  23   3  34  45
1   25  59   6  80  85  41  74  15  81  71
2    5  29  23  51  74  47  74   1  64  26
3   28  22  95  26  44  79  62  17  35  31
4   30  15  86  27  82  40  94  11  87  20

In [342]:
ran_df.loc[0, 0] = 1000

In [343]:
ran_df.head(2)

      0   1  2   3   4   5   6   7   8   9
0  1000  44  4  20  83  84  23   3  34  45
1    25  59  6  80  85  41  74  15  81  71

In [344]:
ran_df.columns = list('ABCDEFGHIJ')

In [345]:
ran_df.head(2)

      A   B  C   D   E   F   G   H   I   J
0  1000  44  4  20  83  84  23   3  34  45
1    25  59  6  80  85  41  74  15  81  71

In [346]:
ran_df.loc[0,0] = 5000

In [347]:
ran_df.head()

      A   B   C   D   E   F   G   H   I   J       0
0  1000  44   4  20  83  84  23   3  34  45  5000.0
1    25  59   6  80  85  41  74  15  81  71     NaN
2     5  29  23  51  74  47  74   1  64  26     NaN
3    28  22  95  26  44  79  62  17  35  31     NaN
4    30  15  86  27  82  40  94  11  87  20     NaN

In [348]:
ran_df.loc[0,'A'] = 2000

In [349]:
ran_df.head(2)

      A   B  C   D   E   F   G   H   I   J       0
0  2000  44  4  20  83  84  23   3  34  45  5000.0
1    25  59  6  80  85  41  74  15  81  71     NaN

In [350]:
ran_df.drop(0)

    A   B   C   D   E   F   G   H   I   J   0
1  25  59   6  80  85  41  74  15  81  71 NaN
2   5  29  23  51  74  47  74   1  64  26 NaN
3  28  22  95  26  44  79  62  17  35  31 NaN
4  30  15  86  27  82  40  94  11  87  20 NaN

In [351]:
ran_df =  ran_df.drop(0, axis=1)

In [352]:
ran_df

      A   B   C   D   E   F   G   H   I   J
0  2000  44   4  20  83  84  23   3  34  45
1    25  59   6  80  85  41  74  15  81  71
2     5  29  23  51  74  47  74   1  64  26
3    28  22  95  26  44  79  62  17  35  31
4    30  15  86  27  82  40  94  11  87  20

In [353]:
ran_df.loc[[2,3,4], ['E','F','G','H']]

    E   F   G   H
2  74  47  74   1
3  44  79  62  17
4  82  40  94  11

In [354]:
ran_df.loc[:, ['E','F','G','H']]

    E   F   G   H
0  83  84  23   3
1  85  41  74  15
2  74  47  74   1
3  44  79  62  17
4  82  40  94  11

In [355]:
ran_df.loc[[2,3,4], :]

    A   B   C   D   E   F   G   H   I   J
2   5  29  23  51  74  47  74   1  64  26
3  28  22  95  26  44  79  62  17  35  31
4  30  15  86  27  82  40  94  11  87  20

In [356]:
ran_df.loc[(ran_df['A']<70) & (ran_df['B']<50)]

    A   B   C   D   E   F   G   H   I   J
2   5  29  23  51  74  47  74   1  64  26
3  28  22  95  26  44  79  62  17  35  31
4  30  15  86  27  82  40  94  11  87  20

In [357]:
ran_df

      A   B   C   D   E   F   G   H   I   J
0  2000  44   4  20  83  84  23   3  34  45
1    25  59   6  80  85  41  74  15  81  71
2     5  29  23  51  74  47  74   1  64  26
3    28  22  95  26  44  79  62  17  35  31
4    30  15  86  27  82  40  94  11  87  20

In [358]:
ran_df.iloc[0,8]

34

In [359]:
ran_df.iloc[[1,2], [0,1,2]]

    A   B   C
1  25  59   6
2   5  29  23

In [360]:
ran_df.drop(0, axis=0)

    A   B   C   D   E   F   G   H   I   J
1  25  59   6  80  85  41  74  15  81  71
2   5  29  23  51  74  47  74   1  64  26
3  28  22  95  26  44  79  62  17  35  31
4  30  15  86  27  82  40  94  11  87  20

In [361]:
ran_df.drop('J', axis=1)

      A   B   C   D   E   F   G   H   I
0  2000  44   4  20  83  84  23   3  34
1    25  59   6  80  85  41  74  15  81
2     5  29  23  51  74  47  74   1  64
3    28  22  95  26  44  79  62  17  35
4    30  15  86  27  82  40  94  11  87

In [362]:
ran_df

      A   B   C   D   E   F   G   H   I   J
0  2000  44   4  20  83  84  23   3  34  45
1    25  59   6  80  85  41  74  15  81  71
2     5  29  23  51  74  47  74   1  64  26
3    28  22  95  26  44  79  62  17  35  31
4    30  15  86  27  82  40  94  11  87  20

In [363]:
ran_df.drop(['I','J'], axis=1, inplace=True)

In [364]:
ran_df

      A   B   C   D   E   F   G   H
0  2000  44   4  20  83  84  23   3
1    25  59   6  80  85  41  74  15
2     5  29  23  51  74  47  74   1
3    28  22  95  26  44  79  62  17
4    30  15  86  27  82  40  94  11

In [365]:
ran_df.drop([3], axis=0, inplace=True)

In [366]:
ran_df

      A   B   C   D   E   F   G   H
0  2000  44   4  20  83  84  23   3
1    25  59   6  80  85  41  74  15
2     5  29  23  51  74  47  74   1
4    30  15  86  27  82  40  94  11

In [367]:
ran_df.reset_index()

   index     A   B   C   D   E   F   G   H
0      0  2000  44   4  20  83  84  23   3
1      1    25  59   6  80  85  41  74  15
2      2     5  29  23  51  74  47  74   1
3      4    30  15  86  27  82  40  94  11

In [368]:
ran_df.reset_index(drop=True, inplace=True)

In [369]:
ran_df

      A   B   C   D   E   F   G   H
0  2000  44   4  20  83  84  23   3
1    25  59   6  80  85  41  74  15
2     5  29  23  51  74  47  74   1
3    30  15  86  27  82  40  94  11

In [370]:
ran_df.isnull()

       A      B      C      D      E      F      G      H
0  False  False  False  False  False  False  False  False
1  False  False  False  False  False  False  False  False
2  False  False  False  False  False  False  False  False
3  False  False  False  False  False  False  False  False

In [371]:
ran_df.isnull().sum()

A    0
B    0
C    0
D    0
E    0
F    0
G    0
H    0
dtype: int64

In [372]:
ran_df.shape

(4, 8)

In [373]:
ran_df

      A   B   C   D   E   F   G   H
0  2000  44   4  20  83  84  23   3
1    25  59   6  80  85  41  74  15
2     5  29  23  51  74  47  74   1
3    30  15  86  27  82  40  94  11

In [374]:
new_ = pd.Series(np.zeros(5))

In [375]:
new_

0    0.0
1    0.0
2    0.0
3    0.0
4    0.0
dtype: float64

In [376]:

ran_df['K'] = new_

In [377]:
ran_df

      A   B   C   D   E   F   G   H    K
0  2000  44   4  20  83  84  23   3  0.0
1    25  59   6  80  85  41  74  15  0.0
2     5  29  23  51  74  47  74   1  0.0
3    30  15  86  27  82  40  94  11  0.0

In [378]:
type(ran_df)

pandas.core.frame.DataFrame

In [379]:
ran_df

      A   B   C   D   E   F   G   H    K
0  2000  44   4  20  83  84  23   3  0.0
1    25  59   6  80  85  41  74  15  0.0
2     5  29  23  51  74  47  74   1  0.0
3    30  15  86  27  82  40  94  11  0.0

In [380]:
ran_df.isnull()

       A      B      C      D      E      F      G      H      K
0  False  False  False  False  False  False  False  False  False
1  False  False  False  False  False  False  False  False  False
2  False  False  False  False  False  False  False  False  False
3  False  False  False  False  False  False  False  False  False

In [381]:
ran_df

      A   B   C   D   E   F   G   H    K
0  2000  44   4  20  83  84  23   3  0.0
1    25  59   6  80  85  41  74  15  0.0
2     5  29  23  51  74  47  74   1  0.0
3    30  15  86  27  82  40  94  11  0.0

In [382]:
ran_df['H'] = None

In [383]:
ran_df.loc[: , 'H'] = None

In [384]:
ran_df

      A   B   C   D   E   F   G     H    K
0  2000  44   4  20  83  84  23  None  0.0
1    25  59   6  80  85  41  74  None  0.0
2     5  29  23  51  74  47  74  None  0.0
3    30  15  86  27  82  40  94  None  0.0

In [385]:
ran_df.isnull()

       A      B      C      D      E      F      G     H      K
0  False  False  False  False  False  False  False  True  False
1  False  False  False  False  False  False  False  True  False
2  False  False  False  False  False  False  False  True  False
3  False  False  False  False  False  False  False  True  False

In [386]:
ran_df['H'].isnull()

0    True
1    True
2    True
3    True
Name: H, dtype: bool

In [390]:
ran_df.dropna(how='all', axis=1)

      A   B   C   D   E   F   G    K
0  2000  44   4  20  83  84  23  0.0
1    25  59   6  80  85  41  74  0.0
2     5  29  23  51  74  47  74  0.0
3    30  15  86  27  82  40  94  0.0

In [391]:
ran_df

      A   B   C   D   E   F   G     H    K
0  2000  44   4  20  83  84  23  None  0.0
1    25  59   6  80  85  41  74  None  0.0
2     5  29  23  51  74  47  74  None  0.0
3    30  15  86  27  82  40  94  None  0.0

In [402]:
new__df = pd.DataFrame({
    'A': [1, 2, 3, np.nan, 5, 6, 7, pd.NaT, 9, 10],
    'B': [np.nan, 2, 3, 4, 5, 6, 7, 8, 9, pd.NaT],
    'C': [1, 2, 3, 4, np.nan, 6, 7, 8, 9, 10]

})

In [403]:
print(new__df)

     A    B     C
0    1  NaN   1.0
1    2    2   2.0
2    3    3   3.0
3  NaN    4   4.0
4    5    5   NaN
5    6    6   6.0
6    7    7   7.0
7  NaT    8   8.0
8    9    9   9.0
9   10  NaT  10.0

In [404]:
new__df.dropna()

   A  B    C
1  2  2  2.0
2  3  3  3.0
5  6  6  6.0
6  7  7  7.0
8  9  9  9.0

In [407]:
new__df.dropna(how='all', axis=1)

     A    B     C
0    1  NaN   1.0
1    2    2   2.0
2    3    3   3.0
3  NaN    4   4.0
4    5    5   NaN
5    6    6   6.0
6    7    7   7.0
7  NaT    8   8.0
8    9    9   9.0
9   10  NaT  10.0

In [408]:
new__df.drop_duplicates()

     A    B     C
0    1  NaN   1.0
1    2    2   2.0
2    3    3   3.0
3  NaN    4   4.0
4    5    5   NaN
5    6    6   6.0
6    7    7   7.0
7  NaT    8   8.0
8    9    9   9.0
9   10  NaT  10.0

In [411]:
new__df.drop_duplicates(subset='A')

     A    B     C
0    1  NaN   1.0
1    2    2   2.0
2    3    3   3.0
3  NaN    4   4.0
4    5    5   NaN
5    6    6   6.0
6    7    7   7.0
7  NaT    8   8.0
8    9    9   9.0
9   10  NaT  10.0

In [412]:
du_df = new__df.copy()

In [417]:
du_df.loc[[1,2,4,5], 'A'] = 1

In [418]:
du_df

     A    B     C
0    1  NaN   1.0
1    1    2   2.0
2    1    3   3.0
3  NaN    4   4.0
4    1    5   NaN
5    1    6   6.0
6    7    7   7.0
7  NaT    8   8.0
8    9    9   9.0
9   10  NaT  10.0

In [419]:
du_df.drop_duplicates(subset='A')

     A    B     C
0    1  NaN   1.0
3  NaN    4   4.0
6    7    7   7.0
7  NaT    8   8.0
8    9    9   9.0
9   10  NaT  10.0

In [420]:
du_df.drop_duplicates(subset='A', keep='last')

     A    B     C
3  NaN    4   4.0
5    1    6   6.0
6    7    7   7.0
7  NaT    8   8.0
8    9    9   9.0
9   10  NaT  10.0

In [422]:
du_df.drop_duplicates(subset='A', keep=False)

     A    B     C
3  NaN    4   4.0
6    7    7   7.0
7  NaT    8   8.0
8    9    9   9.0
9   10  NaT  10.0

In [423]:
du_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       8 non-null      object
 1   B       8 non-null      object
 2   C       9 non-null      float64
dtypes: float64(1), object(2)
memory usage: 372.0+ bytes

In [424]:
du_df.info

<bound method DataFrame.info of      A    B     C
0    1  NaN   1.0
1    1    2   2.0
2    1    3   3.0
3  NaN    4   4.0
4    1    5   NaN
5    1    6   6.0
6    7    7   7.0
7  NaT    8   8.0
8    9    9   9.0
9   10  NaT  10.0>

In [429]:
du_df

     A    B     C
0    1  NaN   1.0
1    1    2   2.0
2    1    3   3.0
3  NaN    4   4.0
4    1    5   NaN
5    1    6   6.0
6    7    7   7.0
7  NaT    8   8.0
8    9    9   9.0
9   10  NaT  10.0

In [432]:
du_df['A'].unique()

array([1, nan, 7, NaT, 9, 10], dtype=object)

In [431]:
du_df['A'].value_counts()

A
1     5
7     1
9     1
10    1
Name: count, dtype: int64

In [434]:
du_df.notnull()

       A      B      C
0   True  False   True
1   True   True   True
2   True   True   True
3  False   True   True
4   True   True  False
5   True   True   True
6   True   True   True
7  False   True   True
8   True   True   True
9   True  False   True

In [435]:
du_df.isnull()

       A      B      C
0  False   True  False
1  False  False  False
2  False  False  False
3   True  False  False
4  False  False   True
5  False  False  False
6  False  False  False
7   True  False  False
8  False  False  False
9  False   True  False

In [438]:
ran_df.corr()

,A,B,C,D,E,F,G,H,K
A,1.000000,0.254813,-0.441592,-0.603061,0.285419,0.987328,-0.948201,NaN,NaN
B,0.254813,1.000000,-0.861399,0.609987,0.494456,0.241204,-0.465892,NaN,NaN
C,-0.441592,-0.861399,1.000000,-0.396247,-0.077159,-0.499411,0.696678,NaN,NaN
D,-0.603061,0.609987,-0.396247,1.000000,0.076291,-0.586086,0.364242,NaN,NaN
E,0.285419,0.494456,-0.077159,0.076291,1.000000,0.141999,-0.186531,NaN,NaN
F,0.987328,0.241204,-0.499411,-0.586086,0.141999,1.000000,-0.968065,NaN,NaN
G,-0.948201,-0.465892,0.696678,0.364242,-0.186531,-0.968065,1.000000,NaN,NaN
H,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
K,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [440]:
num_frame = pd.DataFrame(np.random.randint(1, 100, size=(10, 5))).astype(int)

In [441]:
num_frame

    0   1   2   3   4
0  37  18  89  45  57
1   3  67  65   7  26
2  32  68   9  57  13
3  82  10  25  76  34
4  31   8  76  76  38
5  65  85  19  50  37
6  51  77  14  70  54
7  81  63  43  74  68
8  44  36  75  60  95
9  82  95  18  47  98

In [442]:
num_frame.sum()

0    508
1    527
2    433
3    562
4    520
dtype: int64

In [443]:
num_frame.median()

0    47.5
1    65.0
2    34.0
3    58.5
4    46.0
dtype: float64

In [444]:
num_frame.mean()

0    50.8
1    52.7
2    43.3
3    56.2
4    52.0
dtype: float64

In [445]:
num_frame.std()

0    26.515404
1    32.097248
2    30.247314
3    21.017453
4    28.268553
dtype: float64

In [446]:
num_frame.var()

0     703.066667
1    1030.233333
2     914.900000
3     441.733333
4     799.111111
dtype: float64

In [448]:
num_frame.mode()

      0   1   2     3   4
0  82.0   8   9  76.0  13
1   NaN  10  14   NaN  26
2   NaN  18  18   NaN  34
3   NaN  36  19   NaN  37
4   NaN  63  25   NaN  38
5   NaN  67  43   NaN  54
6   NaN  68  65   NaN  57
7   NaN  77  75   NaN  68
8   NaN  85  76   NaN  95
9   NaN  95  89   NaN  98

In [449]:
num_frame.corr()

          0         1         2         3         4
0  1.000000  0.165595 -0.499627  0.569506  0.450047
1  0.165595  1.000000 -0.638623 -0.356984  0.148051
2 -0.499627 -0.638623  1.000000 -0.214559  0.178548
3  0.569506 -0.356984 -0.214559  1.000000  0.131658
4  0.450047  0.148051  0.178548  0.131658  1.000000

In [453]:
num_frame.ndim

2

In [463]:
num_frame.nlargest(2, 0)

    0   1   2   3   4
3  82  10  25  76  34
9  82  95  18  47  98

In [462]:
num_frame.nsmallest(2, 0)

    0   1   2   3   4
1   3  67  65   7  26
4  31   8  76  76  38

In [466]:
num_frame.sample()

    0   1   2   3   4
8  44  36  75  60  95

In [467]:
num_frame.describe()

               0          1          2          3          4
count  10.000000  10.000000  10.000000  10.000000  10.000000
mean   50.800000  52.700000  43.300000  56.200000  52.000000
std    26.515404  32.097248  30.247314  21.017453  28.268553
min     3.000000   8.000000   9.000000   7.000000  13.000000
25%    33.250000  22.500000  18.250000  47.750000  34.750000
50%    47.500000  65.000000  34.000000  58.500000  46.000000
75%    77.000000  74.750000  72.500000  73.000000  65.250000
max    82.000000  95.000000  89.000000  76.000000  98.000000

In [472]:
num_frame.max()

0    82
1    95
2    89
3    76
4    98
dtype: int32

In [473]:
num_frame.min()

0     3
1     8
2     9
3     7
4    13
dtype: int32

In [477]:
num_frame.quantile(0.25)

0    47.5
1    65.0
2    34.0
3    58.5
4    46.0
Name: 0.5, dtype: float64

In [490]:
num_frame.loc[[0,0],[0,4]] = -100, -45

In [491]:
num_frame.abs()

     0   1   2   3   4
0  100  18  89  45  45
1    3  67  65   7  26
2   32  68   9  57  13
3   82  10  25  76  34
4   31   8  76  76  38
5   65  85  19  50  37
6   51  77  14  70  54
7   81  63  43  74  68
8   44  36  75  60  95
9   82  95  18  47  98

In [492]:
num_frame.apply(lambda x: x + 10)

    0    1   2   3    4
0 -90   28  99  55  -35
1  13   77  75  17   36
2  42   78  19  67   23
3  92   20  35  86   44
4  41   18  86  86   48
5  75   95  29  60   47
6  61   87  24  80   64
7  91   73  53  84   78
8  54   46  85  70  105
9  92  105  28  57  108

In [495]:
num_frame.apply(lambda x: x**2)

       0     1     2     3     4
0  10000   324  7921  2025  2025
1      9  4489  4225    49   676
2   1024  4624    81  3249   169
3   6724   100   625  5776  1156
4    961    64  5776  5776  1444
5   4225  7225   361  2500  1369
6   2601  5929   196  4900  2916
7   6561  3969  1849  5476  4624
8   1936  1296  5625  3600  9025
9   6724  9025   324  2209  9604

In [508]:
num_frame.apply(lambda x: x.sum(), axis=0)

0    371
1    527
2    433
3    562
4    418
dtype: int64

In [509]:
num_frame.apply(lambda x: x.sum(), axis=1)

0      7
1    168
2    179
3    227
4    229
5    256
6    266
7    329
8    310
9    340
dtype: int64

In [513]:
num_frame.apply(sum, axis=0)

0    371
1    527
2    433
3    562
4    418
dtype: int64

In [502]:
num_frame.agg({0:'sum', 1:'mean', 2:'std'})

0    371.000000
1     52.700000
2     30.247314
dtype: float64

In [504]:
num_frame[0].sum()

371

In [505]:
num_frame[1].mean()

52.7

In [506]:
num_frame[2].std()

30.24731393033107

In [510]:
num_frame.aggregate(sum)

C:\Users\Dark_Coder\AppData\Local\Temp\ipykernel_6396\887947717.py:1: FutureWarning: The provided callable <built-in function sum> is currently using DataFrame.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  num_frame.aggregate(sum)

0    371
1    527
2    433
3    562
4    418
dtype: int64

In [511]:
num_frame.agg(sum)

C:\Users\Dark_Coder\AppData\Local\Temp\ipykernel_6396\1772962435.py:1: FutureWarning: The provided callable <built-in function sum> is currently using DataFrame.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  num_frame.agg(sum)

0    371
1    527
2    433
3    562
4    418
dtype: int64

In [514]:
num_frame.agg(['sum', 'mean', 'std'])

               0           1           2           3           4
sum   371.000000  527.000000  433.000000  562.000000  418.000000
mean   37.100000   52.700000   43.300000   56.200000   41.800000
std    54.773169   32.097248   30.247314   21.017453   41.547296

In [515]:
num_frame.aggregate(['sum', 'mean', 'std'])

               0           1           2           3           4
sum   371.000000  527.000000  433.000000  562.000000  418.000000
mean   37.100000   52.700000   43.300000   56.200000   41.800000
std    54.773169   32.097248   30.247314   21.017453   41.547296

In [519]:
num_frame.add_prefix(prefix='col_')

   col_0  col_1  col_2  col_3  col_4
0   -100     18     89     45    -45
1      3     67     65      7     26
2     32     68      9     57     13
3     82     10     25     76     34
4     31      8     76     76     38
5     65     85     19     50     37
6     51     77     14     70     54
7     81     63     43     74     68
8     44     36     75     60     95
9     82     95     18     47     98

In [521]:
num_frame.add_suffix(suffix='_col')

   0_col  1_col  2_col  3_col  4_col
0   -100     18     89     45    -45
1      3     67     65      7     26
2     32     68      9     57     13
3     82     10     25     76     34
4     31      8     76     76     38
5     65     85     19     50     37
6     51     77     14     70     54
7     81     63     43     74     68
8     44     36     75     60     95
9     82     95     18     47     98

In [535]:
num_frame.asof(where=pd.Series([1, 2, 3, 4, 5, 6, 7, 8, 9, 10]))

     0   1   2   3   4
1    3  67  65   7  26
2   32  68   9  57  13
3   82  10  25  76  34
4   31   8  76  76  38
5   65  85  19  50  37
6   51  77  14  70  54
7   81  63  43  74  68
8   44  36  75  60  95
9   82  95  18  47  98
10  82  95  18  47  98

In [536]:
num_frame.assign(new_col=num_frame[0] + num_frame[1])

     0   1   2   3   4  new_col
0 -100  18  89  45 -45      -82
1    3  67  65   7  26       70
2   32  68   9  57  13      100
3   82  10  25  76  34       92
4   31   8  76  76  38       39
5   65  85  19  50  37      150
6   51  77  14  70  54      128
7   81  63  43  74  68      144
8   44  36  75  60  95       80
9   82  95  18  47  98      177

In [538]:
num_frame.assign(new_col=num_frame[0] - num_frame[1])

     0   1   2   3   4  new_col
0 -100  18  89  45 -45     -118
1    3  67  65   7  26      -64
2   32  68   9  57  13      -36
3   82  10  25  76  34       72
4   31   8  76  76  38       23
5   65  85  19  50  37      -20
6   51  77  14  70  54      -26
7   81  63  43  74  68       18
8   44  36  75  60  95        8
9   82  95  18  47  98      -13

In [539]:
num_frame.assign(new_col=num_frame[0] * num_frame[1])

     0   1   2   3   4  new_col
0 -100  18  89  45 -45    -1800
1    3  67  65   7  26      201
2   32  68   9  57  13     2176
3   82  10  25  76  34      820
4   31   8  76  76  38      248
5   65  85  19  50  37     5525
6   51  77  14  70  54     3927
7   81  63  43  74  68     5103
8   44  36  75  60  95     1584
9   82  95  18  47  98     7790

In [493]:
num_frame

     0   1   2   3   4
0 -100  18  89  45 -45
1    3  67  65   7  26
2   32  68   9  57  13
3   82  10  25  76  34
4   31   8  76  76  38
5   65  85  19  50  37
6   51  77  14  70  54
7   81  63  43  74  68
8   44  36  75  60  95
9   82  95  18  47  98

In [17]:
!pip install xlrd

^C

Collecting xlrd
  Downloading xlrd-2.0.1-py2.py3-none-any.whl.metadata (3.4 kB)
Downloading xlrd-2.0.1-py2.py3-none-any.whl (96 kB)
Installing collected packages: xlrd
Successfully installed xlrd-2.0.1

In [18]:
!pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\dark_coder\appdata\local\programs\python\python312\lib\site-packages (3.1.5)
Requirement already satisfied: et-xmlfile in c:\users\dark_coder\appdata\local\programs\python\python312\lib\site-packages (from openpyxl) (1.1.0)

In [19]:
import openpyxl

In [2]:
import pandas as pd

In [20]:
data = pd.read_csv('Dark.csv')
df = pd.DataFrame(data)


df.to_excel("output.xlsx", sheet_name='Sheet_name_1', index=False)

In [3]:
df_ex = pd.read_excel('output.xlsx')

In [7]:
df_ex.head(5)

,id,name,major,GPA,city,age,email,graduation_year
0,1,Dark,Business,2.56,Jacksonville,19,dark@gmail.com,2024
1,2,Jonathan Johnston,Business,3.21,San Diego,20,rmurphy@gmail.com,2025
2,3,Natalie Bentley,Engineering,3.65,San Jose,25,robinsonrita@diaz-miranda.com,2026
3,4,Anita Mills,Chemistry,2.36,Philadelphia,24,qhardy@hotmail.com,2025
4,5,Danielle Cummings,Psychology,2.23,San Diego,19,deleonadam@young-stephenson.com,2024

In [6]:
df_ex.shape

(100, 9)

In [7]:
df_ex.columns

Index(['Unnamed: 0', 'id', 'name', 'major', 'GPA', 'city', 'age', 'email',
       'graduation_year'],
      dtype='object')

In [8]:
df_ex.dtypes

Unnamed: 0           int64
id                   int64
name                object
major               object
GPA                float64
city                object
age                  int64
email               object
graduation_year      int64
dtype: object

In [9]:
df_ex.drop(columns=['Unnamed: 0'], inplace=True)

In [10]:
df_ex

,id,name,major,GPA,city,age,email,graduation_year
0,1,Dark,Business,2.56,Jacksonville,19,dark@gmail.com,2024
1,2,Jonathan Johnston,Business,3.21,San Diego,20,rmurphy@gmail.com,2025
2,3,Natalie Bentley,Engineering,3.65,San Jose,25,robinsonrita@diaz-miranda.com,2026
3,4,Anita Mills,Chemistry,2.36,Philadelphia,24,qhardy@hotmail.com,2025
4,5,Danielle Cummings,Psychology,2.23,San Diego,19,deleonadam@young-stephenson.com,2024
...,...,...,...,...,...,...,...,...
95,96,Christina Quinn,Biology,2.55,Columbus,24,lewiskelly@dawson.com,2023
96,97,Chad Fernandez,Art,2.95,Phoenix,20,kimberlyjohnson@leonard-munoz.com,2026
97,98,Scott Smith,Art,2.91,New York,21,savagekayla@johnson.com,2025
98,99,Stephanie Carrillo,Biology,3.28,San Diego,19,smithmichelle@ramos.com,2023
99,100,Jeffrey Farrell,Engineering,3.43,Houston,24,megan43@yahoo.com,2026

In [11]:
df_ex.describe()

               id         GPA         age  graduation_year
count  100.000000  100.000000  100.000000       100.000000
mean    50.500000    2.997900   21.310000      2024.860000
std     29.011492    0.574321    2.111512         1.428569
min      1.000000    2.020000   18.000000      2023.000000
25%     25.750000    2.475000   20.000000      2024.000000
50%     50.500000    3.050000   21.000000      2025.000000
75%     75.250000    3.490000   23.000000      2026.000000
max    100.000000    3.960000   25.000000      2027.000000

In [12]:
df_ex.isnull()

       id   name  major    GPA   city    age  email  graduation_year
0   False  False  False  False  False  False  False            False
1   False  False  False  False  False  False  False            False
2   False  False  False  False  False  False  False            False
3   False  False  False  False  False  False  False            False
4   False  False  False  False  False  False  False            False
..    ...    ...    ...    ...    ...    ...    ...              ...
95  False  False  False  False  False  False  False            False
96  False  False  False  False  False  False  False            False
97  False  False  False  False  False  False  False            False
98  False  False  False  False  False  False  False            False
99  False  False  False  False  False  False  False            False

[100 rows x 8 columns]

In [13]:
df_ex.loc['Zero'] = None

In [14]:
df_ex

,id,name,major,GPA,city,age,email,graduation_year
0,1.0,Dark,Business,2.56,Jacksonville,19.0,dark@gmail.com,2024.0
1,2.0,Jonathan Johnston,Business,3.21,San Diego,20.0,rmurphy@gmail.com,2025.0
2,3.0,Natalie Bentley,Engineering,3.65,San Jose,25.0,robinsonrita@diaz-miranda.com,2026.0
3,4.0,Anita Mills,Chemistry,2.36,Philadelphia,24.0,qhardy@hotmail.com,2025.0
4,5.0,Danielle Cummings,Psychology,2.23,San Diego,19.0,deleonadam@young-stephenson.com,2024.0
...,...,...,...,...,...,...,...,...
96,97.0,Chad Fernandez,Art,2.95,Phoenix,20.0,kimberlyjohnson@leonard-munoz.com,2026.0
97,98.0,Scott Smith,Art,2.91,New York,21.0,savagekayla@johnson.com,2025.0
98,99.0,Stephanie Carrillo,Biology,3.28,San Diego,19.0,smithmichelle@ramos.com,2023.0
99,100.0,Jeffrey Farrell,Engineering,3.43,Houston,24.0,megan43@yahoo.com,2026.0
Zero,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [16]:
df_ex.isnull()

         id   name  major    GPA   city    age  email  graduation_year
0     False  False  False  False  False  False  False            False
1     False  False  False  False  False  False  False            False
2     False  False  False  False  False  False  False            False
3     False  False  False  False  False  False  False            False
4     False  False  False  False  False  False  False            False
...     ...    ...    ...    ...    ...    ...    ...              ...
96    False  False  False  False  False  False  False            False
97    False  False  False  False  False  False  False            False
98    False  False  False  False  False  False  False            False
99    False  False  False  False  False  False  False            False
Zero   True   True   True   True   True   True   True             True

[101 rows x 8 columns]

In [17]:
df_ex.dropna(inplace=True)

In [18]:
df_ex

,id,name,major,GPA,city,age,email,graduation_year
0,1.0,Dark,Business,2.56,Jacksonville,19.0,dark@gmail.com,2024.0
1,2.0,Jonathan Johnston,Business,3.21,San Diego,20.0,rmurphy@gmail.com,2025.0
2,3.0,Natalie Bentley,Engineering,3.65,San Jose,25.0,robinsonrita@diaz-miranda.com,2026.0
3,4.0,Anita Mills,Chemistry,2.36,Philadelphia,24.0,qhardy@hotmail.com,2025.0
4,5.0,Danielle Cummings,Psychology,2.23,San Diego,19.0,deleonadam@young-stephenson.com,2024.0
...,...,...,...,...,...,...,...,...
95,96.0,Christina Quinn,Biology,2.55,Columbus,24.0,lewiskelly@dawson.com,2023.0
96,97.0,Chad Fernandez,Art,2.95,Phoenix,20.0,kimberlyjohnson@leonard-munoz.com,2026.0
97,98.0,Scott Smith,Art,2.91,New York,21.0,savagekayla@johnson.com,2025.0
98,99.0,Stephanie Carrillo,Biology,3.28,San Diego,19.0,smithmichelle@ramos.com,2023.0
99,100.0,Jeffrey Farrell,Engineering,3.43,Houston,24.0,megan43@yahoo.com,2026.0

In [19]:
df_ex.loc[0, 'name'] = 'Dark Coder'

In [21]:
df_ex.loc[0, 'email'] = 'darkcoder@gmail.com'

In [22]:
df_ex

,id,name,major,GPA,city,age,email,graduation_year
0,1.0,Dark Coder,Business,2.56,Jacksonville,19.0,darkcoder@gmail.com,2024.0
1,2.0,Jonathan Johnston,Business,3.21,San Diego,20.0,rmurphy@gmail.com,2025.0
2,3.0,Natalie Bentley,Engineering,3.65,San Jose,25.0,robinsonrita@diaz-miranda.com,2026.0
3,4.0,Anita Mills,Chemistry,2.36,Philadelphia,24.0,qhardy@hotmail.com,2025.0
4,5.0,Danielle Cummings,Psychology,2.23,San Diego,19.0,deleonadam@young-stephenson.com,2024.0
...,...,...,...,...,...,...,...,...
95,96.0,Christina Quinn,Biology,2.55,Columbus,24.0,lewiskelly@dawson.com,2023.0
96,97.0,Chad Fernandez,Art,2.95,Phoenix,20.0,kimberlyjohnson@leonard-munoz.com,2026.0
97,98.0,Scott Smith,Art,2.91,New York,21.0,savagekayla@johnson.com,2025.0
98,99.0,Stephanie Carrillo,Biology,3.28,San Diego,19.0,smithmichelle@ramos.com,2023.0
99,100.0,Jeffrey Farrell,Engineering,3.43,Houston,24.0,megan43@yahoo.com,2026.0

In [23]:
df_ex.loc['Zero'] = 'namr'

In [24]:
df_ex

,id,name,major,GPA,city,age,email,graduation_year
0,1.0,Dark Coder,Business,2.56,Jacksonville,19.0,darkcoder@gmail.com,2024.0
1,2.0,Jonathan Johnston,Business,3.21,San Diego,20.0,rmurphy@gmail.com,2025.0
2,3.0,Natalie Bentley,Engineering,3.65,San Jose,25.0,robinsonrita@diaz-miranda.com,2026.0
3,4.0,Anita Mills,Chemistry,2.36,Philadelphia,24.0,qhardy@hotmail.com,2025.0
4,5.0,Danielle Cummings,Psychology,2.23,San Diego,19.0,deleonadam@young-stephenson.com,2024.0
...,...,...,...,...,...,...,...,...
96,97.0,Chad Fernandez,Art,2.95,Phoenix,20.0,kimberlyjohnson@leonard-munoz.com,2026.0
97,98.0,Scott Smith,Art,2.91,New York,21.0,savagekayla@johnson.com,2025.0
98,99.0,Stephanie Carrillo,Biology,3.28,San Diego,19.0,smithmichelle@ramos.com,2023.0
99,100.0,Jeffrey Farrell,Engineering,3.43,Houston,24.0,megan43@yahoo.com,2026.0
Zero,namr,namr,namr,namr,namr,namr,namr,namr

In [44]:
df_ex.loc[101] = ['101','Dark Coder','Student',3.67,'London',20, 'darkcoder@gmail.com', 2024]

In [45]:
df_ex

,id,name,major,GPA,city,age,email,graduation_year
0,1.0,Dark Coder,Business,2.56,Jacksonville,19.0,darkcoder@gmail.com,2024.0
1,2.0,Jonathan Johnston,Business,3.21,San Diego,20.0,rmurphy@gmail.com,2025.0
2,3.0,Natalie Bentley,Engineering,3.65,San Jose,25.0,robinsonrita@diaz-miranda.com,2026.0
3,4.0,Anita Mills,Chemistry,2.36,Philadelphia,24.0,qhardy@hotmail.com,2025.0
4,5.0,Danielle Cummings,Psychology,2.23,San Diego,19.0,deleonadam@young-stephenson.com,2024.0
...,...,...,...,...,...,...,...,...
96,97.0,Chad Fernandez,Art,2.95,Phoenix,20.0,kimberlyjohnson@leonard-munoz.com,2026.0
97,98.0,Scott Smith,Art,2.91,New York,21.0,savagekayla@johnson.com,2025.0
98,99.0,Stephanie Carrillo,Biology,3.28,San Diego,19.0,smithmichelle@ramos.com,2023.0
99,100.0,Jeffrey Farrell,Engineering,3.43,Houston,24.0,megan43@yahoo.com,2026.0
101,101,Dark Coder,Student,3.67,London,20,darkcoder@gmail.com,2024

In [46]:
df_ex.loc[101, 'major'] = 'computer Science'

In [47]:
df_ex

,id,name,major,GPA,city,age,email,graduation_year
0,1.0,Dark Coder,Business,2.56,Jacksonville,19.0,darkcoder@gmail.com,2024.0
1,2.0,Jonathan Johnston,Business,3.21,San Diego,20.0,rmurphy@gmail.com,2025.0
2,3.0,Natalie Bentley,Engineering,3.65,San Jose,25.0,robinsonrita@diaz-miranda.com,2026.0
3,4.0,Anita Mills,Chemistry,2.36,Philadelphia,24.0,qhardy@hotmail.com,2025.0
4,5.0,Danielle Cummings,Psychology,2.23,San Diego,19.0,deleonadam@young-stephenson.com,2024.0
...,...,...,...,...,...,...,...,...
96,97.0,Chad Fernandez,Art,2.95,Phoenix,20.0,kimberlyjohnson@leonard-munoz.com,2026.0
97,98.0,Scott Smith,Art,2.91,New York,21.0,savagekayla@johnson.com,2025.0
98,99.0,Stephanie Carrillo,Biology,3.28,San Diego,19.0,smithmichelle@ramos.com,2023.0
99,100.0,Jeffrey Farrell,Engineering,3.43,Houston,24.0,megan43@yahoo.com,2026.0
101,101,Dark Coder,computer Science,3.67,London,20,darkcoder@gmail.com,2024

In [41]:
df_ex

,id,name,major,GPA,city,age,email,graduation_year
0,1.0,Dark Coder,Business,2.56,Jacksonville,19.0,darkcoder@gmail.com,2024.0
1,2.0,Jonathan Johnston,Business,3.21,San Diego,20.0,rmurphy@gmail.com,2025.0
2,3.0,Natalie Bentley,Engineering,3.65,San Jose,25.0,robinsonrita@diaz-miranda.com,2026.0
3,4.0,Anita Mills,Chemistry,2.36,Philadelphia,24.0,qhardy@hotmail.com,2025.0
4,5.0,Danielle Cummings,Psychology,2.23,San Diego,19.0,deleonadam@young-stephenson.com,2024.0
...,...,...,...,...,...,...,...,...
95,96.0,Christina Quinn,Biology,2.55,Columbus,24.0,lewiskelly@dawson.com,2023.0
96,97.0,Chad Fernandez,Art,2.95,Phoenix,20.0,kimberlyjohnson@leonard-munoz.com,2026.0
97,98.0,Scott Smith,Art,2.91,New York,21.0,savagekayla@johnson.com,2025.0
98,99.0,Stephanie Carrillo,Biology,3.28,San Diego,19.0,smithmichelle@ramos.com,2023.0
99,100.0,Jeffrey Farrell,Engineering,3.43,Houston,24.0,megan43@yahoo.com,2026.0

In [49]:
df_ex.loc[101, ['GPA', 'age']] = None, None

In [50]:
df_ex

,id,name,major,GPA,city,age,email,graduation_year
0,1.0,Dark Coder,Business,2.56,Jacksonville,19.0,darkcoder@gmail.com,2024.0
1,2.0,Jonathan Johnston,Business,3.21,San Diego,20.0,rmurphy@gmail.com,2025.0
2,3.0,Natalie Bentley,Engineering,3.65,San Jose,25.0,robinsonrita@diaz-miranda.com,2026.0
3,4.0,Anita Mills,Chemistry,2.36,Philadelphia,24.0,qhardy@hotmail.com,2025.0
4,5.0,Danielle Cummings,Psychology,2.23,San Diego,19.0,deleonadam@young-stephenson.com,2024.0
...,...,...,...,...,...,...,...,...
96,97.0,Chad Fernandez,Art,2.95,Phoenix,20.0,kimberlyjohnson@leonard-munoz.com,2026.0
97,98.0,Scott Smith,Art,2.91,New York,21.0,savagekayla@johnson.com,2025.0
98,99.0,Stephanie Carrillo,Biology,3.28,San Diego,19.0,smithmichelle@ramos.com,2023.0
99,100.0,Jeffrey Farrell,Engineering,3.43,Houston,24.0,megan43@yahoo.com,2026.0
101,101,Dark Coder,computer Science,None,London,None,darkcoder@gmail.com,2024

In [53]:
df_ex.GPA.fillna(df_ex.GPA.mean())

0      2.5600
1      3.2100
2      3.6500
3      2.3600
4      2.2300
        ...
96     2.9500
97     2.9100
98     3.2800
99     3.4300
101    2.9979
Name: GPA, Length: 101, dtype: float64

In [54]:
df_ex

,id,name,major,GPA,city,age,email,graduation_year
0,1.0,Dark Coder,Business,2.5600,Jacksonville,19.0,darkcoder@gmail.com,2024.0
1,2.0,Jonathan Johnston,Business,3.2100,San Diego,20.0,rmurphy@gmail.com,2025.0
2,3.0,Natalie Bentley,Engineering,3.6500,San Jose,25.0,robinsonrita@diaz-miranda.com,2026.0
3,4.0,Anita Mills,Chemistry,2.3600,Philadelphia,24.0,qhardy@hotmail.com,2025.0
4,5.0,Danielle Cummings,Psychology,2.2300,San Diego,19.0,deleonadam@young-stephenson.com,2024.0
...,...,...,...,...,...,...,...,...
96,97.0,Chad Fernandez,Art,2.9500,Phoenix,20.0,kimberlyjohnson@leonard-munoz.com,2026.0
97,98.0,Scott Smith,Art,2.9100,New York,21.0,savagekayla@johnson.com,2025.0
98,99.0,Stephanie Carrillo,Biology,3.2800,San Diego,19.0,smithmichelle@ramos.com,2023.0
99,100.0,Jeffrey Farrell,Engineering,3.4300,Houston,24.0,megan43@yahoo.com,2026.0
101,101,Dark Coder,computer Science,2.9979,London,None,darkcoder@gmail.com,2024

In [57]:
df_ex.age.fillna(df_ex.age.mean(), inplace=True)

C:\Users\Dark_Coder\AppData\Local\Temp\ipykernel_12524\2903272432.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_ex.age.fillna(df_ex.age.mean(), inplace=True)
C:\Users\Dark_Coder\AppData\Local\Temp\ipykernel_12524\2903272432.py:1: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df_ex.age.fillna(df_ex.age.mean(), inplace=True)

In [8]:
df_ex

,id,name,major,GPA,city,age,email,graduation_year
0,1,Dark,Business,2.56,Jacksonville,19,dark@gmail.com,2024
1,2,Jonathan Johnston,Business,3.21,San Diego,20,rmurphy@gmail.com,2025
2,3,Natalie Bentley,Engineering,3.65,San Jose,25,robinsonrita@diaz-miranda.com,2026
3,4,Anita Mills,Chemistry,2.36,Philadelphia,24,qhardy@hotmail.com,2025
4,5,Danielle Cummings,Psychology,2.23,San Diego,19,deleonadam@young-stephenson.com,2024
...,...,...,...,...,...,...,...,...
95,96,Christina Quinn,Biology,2.55,Columbus,24,lewiskelly@dawson.com,2023
96,97,Chad Fernandez,Art,2.95,Phoenix,20,kimberlyjohnson@leonard-munoz.com,2026
97,98,Scott Smith,Art,2.91,New York,21,savagekayla@johnson.com,2025
98,99,Stephanie Carrillo,Biology,3.28,San Diego,19,smithmichelle@ramos.com,2023
99,100,Jeffrey Farrell,Engineering,3.43,Houston,24,megan43@yahoo.com,2026

In [1]:
import pandas as pd

In [11]:
df_ex.ffill.__doc__

'\nFill NA/NaN values by propagating the last valid observation to next valid.\n\nParameters\n----------\naxis : {0 or \'index\'} for Series, {0 or \'index\', 1 or \'columns\'} for DataFrame\n    Axis along which to fill missing values. For `Series`\n    this parameter is unused and defaults to 0.\ninplace : bool, default False\n    If True, fill in-place. Note: this will modify any\n    other views on this object (e.g., a no-copy slice for a column in a\n    DataFrame).\nlimit : int, default None\n    If method is specified, this is the maximum number of consecutive\n    NaN values to forward/backward fill. In other words, if there is\n    a gap with more than this number of consecutive NaNs, it will only\n    be partially filled. If method is not specified, this is the\n    maximum number of entries along the entire axis where NaNs will be\n    filled. Must be greater than 0 if not None.\nlimit_area : {`None`, \'inside\', \'outside\'}, default None\n    If limit is specified, consecutive NaNs will be filled with this\n    restriction.\n\n    * ``None``: No fill restriction.\n    * \'inside\': Only fill NaNs surrounded by valid values\n      (interpolate).\n    * \'outside\': Only fill NaNs outside valid values (extrapolate).\n\n    .. versionadded:: 2.2.0\n\ndowncast : dict, default is None\n    A dict of item->dtype of what to downcast if possible,\n    or the string \'infer\' which will try to downcast to an appropriate\n    equal type (e.g. float64 to int64 if possible).\n\n    .. deprecated:: 2.2.0\n\nReturns\n-------\nSeries/DataFrame or None\n    Object with missing values filled or None if ``inplace=True``.\n\nExamples\n--------\n>>> df = pd.DataFrame([[np.nan, 2, np.nan, 0],\n...                    [3, 4, np.nan, 1],\n...                    [np.nan, np.nan, np.nan, np.nan],\n...                    [np.nan, 3, np.nan, 4]],\n...                   columns=list("ABCD"))\n>>> df\n     A    B   C    D\n0  NaN  2.0 NaN  0.0\n1  3.0  4.0 NaN  1.0\n2  NaN  NaN NaN  NaN\n3  NaN  3.0 NaN  4.0\n\n>>> df.ffill()\n     A    B   C    D\n0  NaN  2.0 NaN  0.0\n1  3.0  4.0 NaN  1.0\n2  3.0  4.0 NaN  1.0\n3  3.0  3.0 NaN  4.0\n\n>>> ser = pd.Series([1, np.nan, 2, 3])\n>>> ser.ffill()\n0   1.0\n1   1.0\n2   2.0\n3   3.0\ndtype: float64\n'

In [12]:
df_ex.bfill.__doc__

"\nFill NA/NaN values by using the next valid observation to fill the gap.\n\nParameters\n----------\naxis : {0 or 'index'} for Series, {0 or 'index', 1 or 'columns'} for DataFrame\n    Axis along which to fill missing values. For `Series`\n    this parameter is unused and defaults to 0.\ninplace : bool, default False\n    If True, fill in-place. Note: this will modify any\n    other views on this object (e.g., a no-copy slice for a column in a\n    DataFrame).\nlimit : int, default None\n    If method is specified, this is the maximum number of consecutive\n    NaN values to forward/backward fill. In other words, if there is\n    a gap with more than this number of consecutive NaNs, it will only\n    be partially filled. If method is not specified, this is the\n    maximum number of entries along the entire axis where NaNs will be\n    filled. Must be greater than 0 if not None.\nlimit_area : {`None`, 'inside', 'outside'}, default None\n    If limit is specified, consecutive NaNs will be filled with this\n    restriction.\n\n    * ``None``: No fill restriction.\n    * 'inside': Only fill NaNs surrounded by valid values\n      (interpolate).\n    * 'outside': Only fill NaNs outside valid values (extrapolate).\n\n    .. versionadded:: 2.2.0\n\ndowncast : dict, default is None\n    A dict of item->dtype of what to downcast if possible,\n    or the string 'infer' which will try to downcast to an appropriate\n    equal type (e.g. float64 to int64 if possible).\n\n    .. deprecated:: 2.2.0\n\nReturns\n-------\nSeries/DataFrame or None\n    Object with missing values filled or None if ``inplace=True``.\n\nExamples\n--------\nFor Series:\n\n>>> s = pd.Series([1, None, None, 2])\n>>> s.bfill()\n0    1.0\n1    2.0\n2    2.0\n3    2.0\ndtype: float64\n>>> s.bfill(limit=1)\n0    1.0\n1    NaN\n2    2.0\n3    2.0\ndtype: float64\n\nWith DataFrame:\n\n>>> df = pd.DataFrame({'A': [1, None, None, 4], 'B': [None, 5, None, 7]})\n>>> df\n      A     B\n0   1.0\t  NaN\n1   NaN\t  5.0\n2   NaN   NaN\n3   4.0   7.0\n>>> df.bfill()\n      A     B\n0   1.0   5.0\n1   4.0   5.0\n2   4.0   7.0\n3   4.0   7.0\n>>> df.bfill(limit=1)\n      A     B\n0   1.0   5.0\n1   NaN   5.0\n2   4.0   7.0\n3   4.0   7.0\n"

In [13]:
df_ex.fillna.__doc__

'\nFill NA/NaN values using the specified method.\n\nParameters\n----------\nvalue : scalar, dict, Series, or DataFrame\n    Value to use to fill holes (e.g. 0), alternately a\n    dict/Series/DataFrame of values specifying which value to use for\n    each index (for a Series) or column (for a DataFrame).  Values not\n    in the dict/Series/DataFrame will not be filled. This value cannot\n    be a list.\nmethod : {\'backfill\', \'bfill\', \'ffill\', None}, default None\n    Method to use for filling holes in reindexed Series:\n\n    * ffill: propagate last valid observation forward to next valid.\n    * backfill / bfill: use next valid observation to fill gap.\n\n    .. deprecated:: 2.1.0\n        Use ffill or bfill instead.\n\naxis : {0 or \'index\'} for Series, {0 or \'index\', 1 or \'columns\'} for DataFrame\n    Axis along which to fill missing values. For `Series`\n    this parameter is unused and defaults to 0.\ninplace : bool, default False\n    If True, fill in-place. Note: this will modify any\n    other views on this object (e.g., a no-copy slice for a column in a\n    DataFrame).\nlimit : int, default None\n    If method is specified, this is the maximum number of consecutive\n    NaN values to forward/backward fill. In other words, if there is\n    a gap with more than this number of consecutive NaNs, it will only\n    be partially filled. If method is not specified, this is the\n    maximum number of entries along the entire axis where NaNs will be\n    filled. Must be greater than 0 if not None.\ndowncast : dict, default is None\n    A dict of item->dtype of what to downcast if possible,\n    or the string \'infer\' which will try to downcast to an appropriate\n    equal type (e.g. float64 to int64 if possible).\n\n    .. deprecated:: 2.2.0\n\nReturns\n-------\nSeries/DataFrame or None\n    Object with missing values filled or None if ``inplace=True``.\n\nSee Also\n--------\nffill : Fill values by propagating the last valid observation to next valid.\nbfill : Fill values by using the next valid observation to fill the gap.\ninterpolate : Fill NaN values using interpolation.\nreindex : Conform object to new index.\nasfreq : Convert TimeSeries to specified frequency.\n\nExamples\n--------\n>>> df = pd.DataFrame([[np.nan, 2, np.nan, 0],\n...                    [3, 4, np.nan, 1],\n...                    [np.nan, np.nan, np.nan, np.nan],\n...                    [np.nan, 3, np.nan, 4]],\n...                   columns=list("ABCD"))\n>>> df\n     A    B   C    D\n0  NaN  2.0 NaN  0.0\n1  3.0  4.0 NaN  1.0\n2  NaN  NaN NaN  NaN\n3  NaN  3.0 NaN  4.0\n\nReplace all NaN elements with 0s.\n\n>>> df.fillna(0)\n     A    B    C    D\n0  0.0  2.0  0.0  0.0\n1  3.0  4.0  0.0  1.0\n2  0.0  0.0  0.0  0.0\n3  0.0  3.0  0.0  4.0\n\nReplace all NaN elements in column \'A\', \'B\', \'C\', and \'D\', with 0, 1,\n2, and 3 respectively.\n\n>>> values = {"A": 0, "B": 1, "C": 2, "D": 3}\n>>> df.fillna(value=values)\n     A    B    C    D\n0  0.0  2.0  2.0  0.0\n1  3.0  4.0  2.0  1.0\n2  0.0  1.0  2.0  3.0\n3  0.0  3.0  2.0  4.0\n\nOnly replace the first NaN element.\n\n>>> df.fillna(value=values, limit=1)\n     A    B    C    D\n0  0.0  2.0  2.0  0.0\n1  3.0  4.0  NaN  1.0\n2  NaN  1.0  NaN  3.0\n3  NaN  3.0  NaN  4.0\n\nWhen filling using a DataFrame, replacement happens along\nthe same column names and same indices\n\n>>> df2 = pd.DataFrame(np.zeros((4, 4)), columns=list("ABCE"))\n>>> df.fillna(df2)\n     A    B    C    D\n0  0.0  2.0  0.0  0.0\n1  3.0  4.0  0.0  1.0\n2  0.0  0.0  0.0  NaN\n3  0.0  3.0  0.0  4.0\n\nNote that column D is not affected since it is not present in df2.\n'

In [23]:
df_ex

,id,name,major,GPA,city,age,email,graduation_year
0,1,Dark,Business,2.56,Jacksonville,19,dark@gmail.com,2024
1,2,Jonathan Johnston,Business,3.21,San Diego,20,rmurphy@gmail.com,2025
2,3,Natalie Bentley,Engineering,3.65,San Jose,25,robinsonrita@diaz-miranda.com,2026
3,4,Anita Mills,Chemistry,2.36,Philadelphia,24,qhardy@hotmail.com,2025
4,5,Danielle Cummings,Psychology,2.23,San Diego,19,deleonadam@young-stephenson.com,2024
...,...,...,...,...,...,...,...,...
95,96,Christina Quinn,Biology,2.55,Columbus,24,lewiskelly@dawson.com,2023
96,97,Chad Fernandez,Art,2.95,Phoenix,20,kimberlyjohnson@leonard-munoz.com,2026
97,98,Scott Smith,Art,2.91,New York,21,savagekayla@johnson.com,2025
98,99,Stephanie Carrillo,Biology,3.28,San Diego,19,smithmichelle@ramos.com,2023
99,100,Jeffrey Farrell,Engineering,3.43,Houston,24,megan43@yahoo.com,2026

In [4]:
df_ex.loc[1:10, 'GPA'] = None
# df_ex.loc[[50, 70], 'age'] = None

In [6]:
df_ex.head(11)

,id,name,major,GPA,city,age,email,graduation_year
0,1,Dark,Business,2.56,Jacksonville,19,dark@gmail.com,2024
1,2,Jonathan Johnston,Business,NaN,San Diego,20,rmurphy@gmail.com,2025
2,3,Natalie Bentley,Engineering,NaN,San Jose,25,robinsonrita@diaz-miranda.com,2026
3,4,Anita Mills,Chemistry,NaN,Philadelphia,24,qhardy@hotmail.com,2025
4,5,Danielle Cummings,Psychology,NaN,San Diego,19,deleonadam@young-stephenson.com,2024
5,6,Crystal Rodriguez,Art,NaN,San Antonio,20,dianajordan@gmail.com,2024
6,7,Ashley Sanchez,Engineering,NaN,San Jose,20,zcoleman@ruiz.com,2027
7,8,Matthew Cruz,Psychology,NaN,Charlotte,22,xbauer@gmail.com,2027
8,9,Alexander Rowe,Engineering,NaN,Philadelphia,21,jason85@jimenez.com,2026
9,10,Mrs. Jessica Mcdonald,Physics,NaN,Philadelphia,21,lauraallen@yahoo.com,2023
10,11,Marcus Quinn,English,NaN,San Diego,22,sandersbenjamin@gmail.com,2024

In [7]:
df_ex.ffill().head(10)

,id,name,major,GPA,city,age,email,graduation_year
0,1,Dark,Business,2.56,Jacksonville,19,dark@gmail.com,2024
1,2,Jonathan Johnston,Business,2.56,San Diego,20,rmurphy@gmail.com,2025
2,3,Natalie Bentley,Engineering,2.56,San Jose,25,robinsonrita@diaz-miranda.com,2026
3,4,Anita Mills,Chemistry,2.56,Philadelphia,24,qhardy@hotmail.com,2025
4,5,Danielle Cummings,Psychology,2.56,San Diego,19,deleonadam@young-stephenson.com,2024
5,6,Crystal Rodriguez,Art,2.56,San Antonio,20,dianajordan@gmail.com,2024
6,7,Ashley Sanchez,Engineering,2.56,San Jose,20,zcoleman@ruiz.com,2027
7,8,Matthew Cruz,Psychology,2.56,Charlotte,22,xbauer@gmail.com,2027
8,9,Alexander Rowe,Engineering,2.56,Philadelphia,21,jason85@jimenez.com,2026
9,10,Mrs. Jessica Mcdonald,Physics,2.56,Philadelphia,21,lauraallen@yahoo.com,2023

In [8]:
df_ex.bfill().head(10)

,id,name,major,GPA,city,age,email,graduation_year
0,1,Dark,Business,2.56,Jacksonville,19,dark@gmail.com,2024
1,2,Jonathan Johnston,Business,3.13,San Diego,20,rmurphy@gmail.com,2025
2,3,Natalie Bentley,Engineering,3.13,San Jose,25,robinsonrita@diaz-miranda.com,2026
3,4,Anita Mills,Chemistry,3.13,Philadelphia,24,qhardy@hotmail.com,2025
4,5,Danielle Cummings,Psychology,3.13,San Diego,19,deleonadam@young-stephenson.com,2024
5,6,Crystal Rodriguez,Art,3.13,San Antonio,20,dianajordan@gmail.com,2024
6,7,Ashley Sanchez,Engineering,3.13,San Jose,20,zcoleman@ruiz.com,2027
7,8,Matthew Cruz,Psychology,3.13,Charlotte,22,xbauer@gmail.com,2027
8,9,Alexander Rowe,Engineering,3.13,Philadelphia,21,jason85@jimenez.com,2026
9,10,Mrs. Jessica Mcdonald,Physics,3.13,Philadelphia,21,lauraallen@yahoo.com,2023

In [9]:
df_ex.fillna(df_ex['GPA'].mean()).head(25)

,id,name,major,GPA,city,age,email,graduation_year
0,1,Dark,Business,2.560000,Jacksonville,19,dark@gmail.com,2024
1,2,Jonathan Johnston,Business,3.009333,San Diego,20,rmurphy@gmail.com,2025
2,3,Natalie Bentley,Engineering,3.009333,San Jose,25,robinsonrita@diaz-miranda.com,2026
3,4,Anita Mills,Chemistry,3.009333,Philadelphia,24,qhardy@hotmail.com,2025
4,5,Danielle Cummings,Psychology,3.009333,San Diego,19,deleonadam@young-stephenson.com,2024
5,6,Crystal Rodriguez,Art,3.009333,San Antonio,20,dianajordan@gmail.com,2024
6,7,Ashley Sanchez,Engineering,3.009333,San Jose,20,zcoleman@ruiz.com,2027
7,8,Matthew Cruz,Psychology,3.009333,Charlotte,22,xbauer@gmail.com,2027
8,9,Alexander Rowe,Engineering,3.009333,Philadelphia,21,jason85@jimenez.com,2026
9,10,Mrs. Jessica Mcdonald,Physics,3.009333,Philadelphia,21,lauraallen@yahoo.com,2023
10,11,Marcus Quinn,English,3.009333,San Diego,22,sandersbenjamin@gmail.com,2024
11,12,Michael Warren,Mathematics,3.130000,Phoenix,20,adambranch@yahoo.com,2025
12,13,Russell Dennis,Physics,3.910000,San Diego,22,gregorygriffin@roberts-todd.com,2024
13,14,Deborah Bowman MD,Biology,2.090000,Columbus,18,obrady@williamson.com,2025
14,15,Gregory Johnson,Art,3.310000,Fort Worth,20,jamesmurphy@yahoo.com,2024
15,16,Ryan Campos,English,2.350000,Houston,20,gregory47@yahoo.com,2025
16,17,Anthony Knight,Mathematics,2.700000,Dallas,22,jeffreytaylor@yahoo.com,2025
17,18,Michelle Hood,Sociology,3.200000,Philadelphia,18,tracy70@hotmail.com,2024
18,19,Scott Gibson,Art,3.300000,Jacksonville,19,jareddiaz@cook.org,2026
19,20,Brandy Morgan,Economics,3.350000,San Antonio,22,cindy08@long-wilson.info,2024
20,21,Thomas Moran,Music,3.790000,New York,25,brandonbutler@gmail.com,2027
21,22,Mark Freeman,Sociology,2.630000,Philadelphia,18,megan21@thomas.net,2027
22,23,Gary Reeves,Music,3.770000,Houston,23,michelleparks@evans.com,2025
23,24,Ashley Robinson,History,2.590000,San Jose,23,derrick38@morgan.com,2026
24,25,Kristen Bailey,Biology,3.230000,Fort Worth,22,petersdesiree@gmail.com,2027

In [4]:
df_ex.fillna(df_ex['GPA'].median()).head(15)

,id,name,major,GPA,city,age,email,graduation_year
0,1,Dark,Business,2.56,Jacksonville,19,dark@gmail.com,2024
1,2,Jonathan Johnston,Business,3.21,San Diego,20,rmurphy@gmail.com,2025
2,3,Natalie Bentley,Engineering,3.65,San Jose,25,robinsonrita@diaz-miranda.com,2026
3,4,Anita Mills,Chemistry,2.36,Philadelphia,24,qhardy@hotmail.com,2025
4,5,Danielle Cummings,Psychology,2.23,San Diego,19,deleonadam@young-stephenson.com,2024
5,6,Crystal Rodriguez,Art,2.77,San Antonio,20,dianajordan@gmail.com,2024
6,7,Ashley Sanchez,Engineering,2.23,San Jose,20,zcoleman@ruiz.com,2027
7,8,Matthew Cruz,Psychology,2.66,Charlotte,22,xbauer@gmail.com,2027
8,9,Alexander Rowe,Engineering,3.02,Philadelphia,21,jason85@jimenez.com,2026
9,10,Mrs. Jessica Mcdonald,Physics,3.55,Philadelphia,21,lauraallen@yahoo.com,2023
10,11,Marcus Quinn,English,3.27,San Diego,22,sandersbenjamin@gmail.com,2024
11,12,Michael Warren,Mathematics,3.13,Phoenix,20,adambranch@yahoo.com,2025
12,13,Russell Dennis,Physics,3.91,San Diego,22,gregorygriffin@roberts-todd.com,2024
13,14,Deborah Bowman MD,Biology,2.09,Columbus,18,obrady@williamson.com,2025
14,15,Gregory Johnson,Art,3.31,Fort Worth,20,jamesmurphy@yahoo.com,2024

In [14]:
doc = pd.DataFrame.mean.__doc__

In [15]:
print(doc, end='\n')

Return the mean of the values over the requested axis.

Parameters
----------
axis : {index (0), columns (1)}
    Axis for the function to be applied on.
    For `Series` this parameter is unused and defaults to 0.

    For DataFrames, specifying ``axis=None`` will apply the aggregation
    across both axes.

    .. versionadded:: 2.0.0

skipna : bool, default True
    Exclude NA/null values when computing the result.
numeric_only : bool, default False
    Include only float, int, boolean columns. Not implemented for Series.

**kwargs
    Additional keyword arguments to be passed to the function.

Returns
-------
Series or scalar

            Examples
            --------
            >>> s = pd.Series([1, 2, 3])
            >>> s.mean()
            2.0

            With a DataFrame

            >>> df = pd.DataFrame({'a': [1, 2], 'b': [2, 3]}, index=['tiger', 'zebra'])
            >>> df
                   a   b
            tiger  1   2
            zebra  2   3
            >>> df.mean()
            a   1.5
            b   2.5
            dtype: float64

            Using axis=1

            >>> df.mean(axis=1)
            tiger   1.5
            zebra   2.5
            dtype: float64

            In this case, `numeric_only` should be set to `True` to avoid
            getting an error.

            >>> df = pd.DataFrame({'a': [1, 2], 'b': ['T', 'Z']},
            ...                   index=['tiger', 'zebra'])
            >>> df.mean(numeric_only=True)
            a   1.5
            dtype: float64

In [10]:
doc=pd.DataFrame.median.__doc__

In [13]:
print(doc, end='\n')

Return the median of the values over the requested axis.

Parameters
----------
axis : {index (0), columns (1)}
    Axis for the function to be applied on.
    For `Series` this parameter is unused and defaults to 0.

    For DataFrames, specifying ``axis=None`` will apply the aggregation
    across both axes.

    .. versionadded:: 2.0.0

skipna : bool, default True
    Exclude NA/null values when computing the result.
numeric_only : bool, default False
    Include only float, int, boolean columns. Not implemented for Series.

**kwargs
    Additional keyword arguments to be passed to the function.

Returns
-------
Series or scalar

            Examples
            --------
            >>> s = pd.Series([1, 2, 3])
            >>> s.median()
            2.0

            With a DataFrame

            >>> df = pd.DataFrame({'a': [1, 2], 'b': [2, 3]}, index=['tiger', 'zebra'])
            >>> df
                   a   b
            tiger  1   2
            zebra  2   3
            >>> df.median()
            a   1.5
            b   2.5
            dtype: float64

            Using axis=1

            >>> df.median(axis=1)
            tiger   1.5
            zebra   2.5
            dtype: float64

            In this case, `numeric_only` should be set to `True`
            to avoid getting an error.

            >>> df = pd.DataFrame({'a': [1, 2], 'b': ['T', 'Z']},
            ...                   index=['tiger', 'zebra'])
            >>> df.median(numeric_only=True)
            a   1.5
            dtype: float64

In [19]:
import numpy as np

In [31]:
list_ = [1, 2, 3, 4, 50]
pd_ser = pd.Series(list_)

In [32]:
pd_ser.mean()

12.0

In [33]:
pd_ser.median()

3.0

In [34]:
pd_ser.mode()

0     1
1     2
2     3
3     4
4    50
dtype: int64

In [10]:
df_ex.head(25)

,id,name,major,GPA,city,age,email,graduation_year
0,1,Dark,Business,2.56,Jacksonville,19,dark@gmail.com,2024
1,2,Jonathan Johnston,Business,NaN,San Diego,20,rmurphy@gmail.com,2025
2,3,Natalie Bentley,Engineering,NaN,San Jose,25,robinsonrita@diaz-miranda.com,2026
3,4,Anita Mills,Chemistry,NaN,Philadelphia,24,qhardy@hotmail.com,2025
4,5,Danielle Cummings,Psychology,NaN,San Diego,19,deleonadam@young-stephenson.com,2024
5,6,Crystal Rodriguez,Art,NaN,San Antonio,20,dianajordan@gmail.com,2024
6,7,Ashley Sanchez,Engineering,NaN,San Jose,20,zcoleman@ruiz.com,2027
7,8,Matthew Cruz,Psychology,NaN,Charlotte,22,xbauer@gmail.com,2027
8,9,Alexander Rowe,Engineering,NaN,Philadelphia,21,jason85@jimenez.com,2026
9,10,Mrs. Jessica Mcdonald,Physics,NaN,Philadelphia,21,lauraallen@yahoo.com,2023
10,11,Marcus Quinn,English,NaN,San Diego,22,sandersbenjamin@gmail.com,2024
11,12,Michael Warren,Mathematics,3.13,Phoenix,20,adambranch@yahoo.com,2025
12,13,Russell Dennis,Physics,3.91,San Diego,22,gregorygriffin@roberts-todd.com,2024
13,14,Deborah Bowman MD,Biology,2.09,Columbus,18,obrady@williamson.com,2025
14,15,Gregory Johnson,Art,3.31,Fort Worth,20,jamesmurphy@yahoo.com,2024
15,16,Ryan Campos,English,2.35,Houston,20,gregory47@yahoo.com,2025
16,17,Anthony Knight,Mathematics,2.70,Dallas,22,jeffreytaylor@yahoo.com,2025
17,18,Michelle Hood,Sociology,3.20,Philadelphia,18,tracy70@hotmail.com,2024
18,19,Scott Gibson,Art,3.30,Jacksonville,19,jareddiaz@cook.org,2026
19,20,Brandy Morgan,Economics,3.35,San Antonio,22,cindy08@long-wilson.info,2024
20,21,Thomas Moran,Music,3.79,New York,25,brandonbutler@gmail.com,2027
21,22,Mark Freeman,Sociology,2.63,Philadelphia,18,megan21@thomas.net,2027
22,23,Gary Reeves,Music,3.77,Houston,23,michelleparks@evans.com,2025
23,24,Ashley Robinson,History,2.59,San Jose,23,derrick38@morgan.com,2026
24,25,Kristen Bailey,Biology,3.23,Fort Worth,22,petersdesiree@gmail.com,2027